 
# Задача1:

answer = "Это {petSpecie} по кличке {petName}. Возраст: {petAge}"
print(answer.format(petSpecie = input('Введите вид питомца:'),petName = input('Введите кличку питомца:'), petAge = input('Введите возраст питомца:')))

# Задача2:

a1 = input('Появились 17-18 млн лет назад и обитали в тропических лесах. Это ранние человекообразные обезьяны, которые, вероятно, появились в Африке и пришли в Европу во время пересыхания доисторического моря Тетис. Группы этих обезьян лазили по деревьям и питались их плодами, поскольку их коренные зубы, покрытые тонким слоем эмали, не были пригодны для пережевывания грубой пищи. Возможно, дальним предком человека был рамапитек. Предполагается, что рамапитеки появились 14 млн лет назад. О их существовании стало известно по найденным в Сиваликских горах в Индии фрагментам челюсти.')
a2 = input('Населявшие Африку 1,5-5,5 млн лет назад, были связующим звеном между животным миром и первыми людьми. Австралопитеки не имели таких естественных органов защиты, как мощные челюсти, клыки и острые когти, и уступали в физической силе крупным животным. Тело австралопитека покрывал густой волосяной покров, и по внешнему виду он был ближе к обезьяне, чем к человеку. Однако он уже ходил на двух ногах и пользовался разными предметами как орудиями, чему способствовал отстоящий большой палец кисти. Объем его мозга (по отношению к объему тела) был меньше человеческого, но больше, чем у современных человекообразных обезьян. Использование природных предметов в качестве орудий для защиты и нападения позволило австралопитекам защищать себя от врагов.')
a3 = input('Считается самым первым представителем человеческого рода, он жил 2,4-1,5 млн лет назад в Африке и назван так из-за умения изготовлять простейшие каменные орудия. Его мозг на треть превосходил мозг австралопитека, а биологические особенности мозга свидетельствуют о возможных зачатках речи. В остальном человек умелый более походил на австралопитека, чем на современного человека.В 60-70 гг. XX в. в Африке же были обнаружены останки существ, объем полости черепа которых составлял 650 см3. В непосредственной близости от места находки были обнаружены самые примитивные орудия труда из гальки. Судя по найденным останкам, датирующимся 2-1,5 млн лет назад, человек умелый существовал более полумиллиона лет, медленно эволюционировал, пока не приобрел значительное сходство с человеком прямоходящим.')
a4 = input('Расселился 1,8 млн - 300 тыс. лет назад по Африке, Европе и Азии. Он делал сложные орудия и уже умел использовать огонь. Его мозг по объему близок к мозгу современного человека, что позволяло ему организовывать коллективную деятельность (охоту на крупных животных) и использовать речь. Одной из самых замечательных была находка первого питекантропа, или человека прямоходящего (Homo erektus), обнаруженного голландским ученым Э. Дюбуа в 1881 г. В период от 500 до 200 тыс. лет назад происходил переход от человека прямоходящего к разумному человеку (Homo sapiens).')
a5 = input('Обладают сходными признаками: массивная со скошенным подбородком челюсть сильно выступает вперед, на низком покатом лбу имеется надглазничный валик, высота черепа по сравнению с черепом современного человека мала, но объем мозга варьирует в пределах 800-1400 см3. Наряду с добыванием растительной пищи питекантропы занимались охотой, о чем свидетельствуют находки в местах их жизни костей мелких грызунов, оленей, медведей, диких лошадей, буйволов. Довольно трудно обнаружить границу, когда один вид сменяет другой, поэтому представителей этого переходного периода иногда именуют древнейшим человеком разумным.')
a6 = input('Текущий этап')


print(a1, a2, a3,a4,a5,a6, sep='=>')